# Common packages for all machines

#
# Taps
#

tap "d12frosted/emacs-plus"
tap "koekeishiya/formulae"
tap "tinted-theming/tinted"

################################################################################
#
# CLI Tools
#
################################################################################

#
# Shell & Prompt
#

brew "fish"
brew "starship"

#
# Search & Navigation
#

brew "fd"
brew "fzf"
brew "ripgrep"

#
# File Viewers & Utilities
#

brew "bat"
brew "eza"
brew "htop"
brew "jq"

#
# Network
#

brew "curl"
brew "wget"
brew "openssh"

#
# Text & Document Processing
#

brew "pandoc"
brew "imagemagick"

#
# Security
#

brew "gnupg"
brew "pinentry-mac"
cask "gpg-suite"

#
# Development
#

brew "git"
brew "git-lfs"
brew "llvm"
brew "node"
brew "yarn"
brew "shellcheck"

#
# Finance
#

brew "hledger"

#
# System Utilities
#

brew "fswatch"
brew "terminal-notifier"
brew "tinty"

################################################################################
#
# Window Management
#
################################################################################

brew "yabai"
brew "skhd"

################################################################################
#
# Desktop Applications
#
################################################################################

#
# Editors
#

brew "emacs-plus@30", args: ["with-dragon-icon"]

#
# Terminals
#

cask "alacritty"

#
# Browsers
#

cask "brave-browser"
cask "firefox"

#
# Productivity
#

cask "bartender"
cask "maccy"
cask "raycast"
cask "shottr"

#
# AI Assistants
#

cask "chatgpt"
cask "claude"

#
# Development
#

cask "dbeaver-community"
cask "figma"
cask "rancher"

#
# Media
#

cask "cog-app"
cask "spotify"
cask "stolendata-mpv"

#
# Communication
#

cask "telegram"

#
# Security & Privacy
#

cask "cryptomator"
cask "proton-pass"
cask "protonvpn"

#
# System Utilities
#

cask "appcleaner"
cask "syncthing-app"
cask "transmission"

################################################################################
#
# Fonts
#
################################################################################

cask "font-iosevka"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
