# Common packages for all machines

#
# Taps
#

tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "tinted-theming/tinted"

################################################################################
#
# CLI Tools
#
################################################################################

#
# Shell & Prompt
#

brew "fish"
brew "starship"

#
# Search & Navigation
#

brew "fd"
brew "findutils"
brew "fzf"
brew "grep"
brew "ripgrep"

#
# File Viewers & Utilities
#

brew "bat"
brew "coreutils"
brew "eza"
brew "hq"
brew "htop"
brew "jq"
brew "rename"

#
# Network
#

brew "curl"
brew "wget"
brew "openssh"

#
# Text & Document Processing
#

brew "awk"
brew "gnu-sed"
brew "gnumeric"
brew "imagemagick"
brew "pandoc"
brew "texinfo"
brew "vips"

#
# Security
#

brew "gnupg"
brew "pinentry-mac"
cask "gpg-suite"

#
# Development
#

brew "automake"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-sizer"
brew "gnu-tar"
brew "llvm"
brew "make"
brew "node"
brew "go"
brew "shellcheck"
brew "yarn"

#
# Finance
#

brew "hledger"

#
# System Utilities
#

brew "cliclick"
brew "fswatch"
brew "terminal-notifier"
brew "tinted-theming/tinted/tinty"

################################################################################
#
# Window Management
#
################################################################################

brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "felixkratz/formulae/borders"

################################################################################
#
# Desktop Applications
#
################################################################################

#
# Editors
#

cask "d12frosted/emacs-plus/emacs-plus-app@master"

#
# Terminals
#

cask "alacritty"

#
# Browsers
#

cask "brave-browser"
cask "firefox"

#
# Productivity
#

cask "bartender"
cask "maccy"
cask "raycast"
cask "shottr"

#
# AI Assistants
#

cask "chatgpt"
cask "claude"

#
# Development
#

cask "dbeaver-community"
cask "figma"
cask "rancher"

#
# Media
#

cask "cog-app"
cask "spotify"
cask "stolendata-mpv"

#
# Communication
#

cask "element"
cask "telegram"

#
# Security & Privacy
#

cask "cryptomator"
cask "proton-pass"
cask "protonvpn"

#
# System Utilities
#

cask "appcleaner"
cask "syncthing-app"
cask "transmission"

#
# Gaming
#

brew "rom-tools"
cask "whisky"

################################################################################
#
# Fonts
#
################################################################################

cask "font-iosevka"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
