# taps
tap "d12frosted/emacs-plus"
tap "caskroom/fonts"

# important
brew "git"
brew "haskell-stack"
brew "emacs-plus", args: ["without-spacemacs-icon"]
brew "cask", args: ["ignore-dependencies"]
brew "wget"
brew "ack"
brew "ag"
brew "tree"
brew "ncdu"
brew "terminal-notifier", link: true
brew "ossp-uuid"
brew "mu"
brew "fish"
brew "shellcheck"
brew "hunspell"

# scala
cask "java"
brew "sbt"
brew "scala"

# applications
cask "dropbox"
cask "spectacle"
cask "alfred"
cask "bartender"
cask "google-chrome"
cask "firefox"
cask "gpg-suite"
cask "xquartz"

# fonts
cask "font-source-code-pro"
