# taps
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "d12frosted/emacs-plus"
tap "koekeishiya/formulae"
tap "scalacenter/bloop"

# important
brew "ack"
brew "ag"
brew "aspell"
brew "bash"
brew "bat"
brew "certbot"
brew "coreutils"
brew "docker"
brew "emacs-plus@28"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gopass"
brew "graphviz"
brew "grep"
brew "hledger"
brew "jq"
brew "ncdu"
brew "node"
brew "ossp-uuid"
brew "pandoc"
brew "pinentry-mac"
brew "prettier"
brew "proselint"
brew "pygments"
brew "rg"
brew "shellcheck"
brew "skhd", args: ["with-logging", "HEAD"], restart_service: :changed
brew "terminal-notifier", link: true
brew "tree"
brew "wget"
brew "yabai", restart_service: :changed

# scala
brew "maven"
brew "sbt"
brew "scala"
brew "bloop"
cask "java"

# applications
cask "alfred"
cask "bartender"
cask "cryptomator"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-fontawesome"
cask "gopass-ui"
cask "gpg-suite"
cask "kitty"
cask "mactex"
cask "platypus"
cask "slack"
cask "telegram"
cask "tor-browser"
cask "vlc"
cask "vox"
cask "vox-preferences-pane"
cask "xquartz"

# other
brew "gifsicle"

# fonts
cask "font-source-code-pro"
