# taps
tap "caskroom/fonts"
tap "crisidev/homebrew-chunkwm"
tap "d12frosted/emacs-plus"
tap "koekeishiya/formulae"

# important
brew "ack"
brew "ag"
brew "aspell"
brew "cask", args: ["ignore-dependencies"]
brew "certbot"
brew "chunkwm", args: ["with-purify", "HEAD"], restart_service: :changed
brew "docker"
brew "emacs-plus", args: ["without-spacemacs-icon"]
brew "fd"
brew "ffmpeg"
brew "fish"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "haskell-stack"
brew "jq"
brew "mu", args: ["with-emacs"]
brew "ncdu"
brew "ossp-uuid"
brew "pandoc"
brew "shellcheck"
brew "skhd", args: ["with-logging", "HEAD"], restart_service: :changed
brew "terminal-notifier", link: true
brew "tree"
brew "wget"
brew "coreutils"

# scala
brew "maven"
brew "sbt"
brew "scala"
cask "intellij-idea"
cask "java"
cask "homebrew/cask-versions/java8"

# applications
cask "alfred"
cask "bartender"
cask "cryptomator"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-fontawesome"
cask "google-chrome"
cask "gpg-suite"
cask "mactex"
cask "slack"
cask "telegram"
cask "ubersicht"
cask "vox"
cask "vox-preferences-pane"
cask "xquartz"

# fonts
cask "font-source-code-pro"
